import React from "react";
import s from "./Styles.module.scss";
import s_modal from "components/Modals/Styles.module.scss";

function ModalBigContent({ hide }: any) {
    return (
        <div className={s.main}>
            <div className={s.title}>Заголовок</div>
            <div className={s.description}>Любое описание.</div>

            <div className={s_modal.modal_area_scroll} style={{ height: "calc(100vh - 306px)" }}>
                <div>
                    Но высокотехнологичная концепция общественного уклада, в своём классическом представлении, допускает внедрение как
                    самодостаточных, так и внешне зависимых концептуальных решений. Задача организации, в особенности же высокотехнологичная
                    концепция общественного уклада создаёт необходимость включения в производственный план целого ряда внеочередных
                    мероприятий с учётом комплекса экспериментов, поражающих по своей масштабности и грандиозности. Банальные, но
                    неопровержимые выводы, а также элементы политического процесса, которые представляют собой яркий пример
                    континентально-европейского типа политической культуры, будут заблокированы в рамках своих собственных рациональных
                    ограничений. Принимая во внимание показатели успешности, высокотехнологичная концепция общественного уклада влечет за
                    собой процесс внедрения и модернизации новых принципов формирования материально-технической и кадровой базы. Как принято
                    считать, сторонники тоталитаризма в науке неоднозначны и будут в равной степени предоставлены сами себе. И нет сомнений,
                    что базовые сценарии поведения пользователей, инициированные исключительно синтетически, разоблачены. С учётом
                    сложившейся международной обстановки, разбавленное изрядной долей эмпатии, рациональное мышление способствует подготовке
                    и реализации приоретизации разума над эмоциями. Таким образом, постоянный количественный рост и сфера нашей активности,
                    а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для укрепления моральных ценностей! Наше
                    дело не так однозначно, как может показаться: новая модель организационной деятельности предопределяет высокую
                    востребованность инновационных методов управления процессами. Принимая во внимание показатели успешности, глубокий
                    уровень погружения не даёт нам иного выбора, кроме определения новых принципов формирования материально-технической и
                    кадровой базы. Задача организации, в особенности же базовый вектор развития создаёт предпосылки для системы обучения
                    кадров, соответствующей насущным потребностям. Принимая во внимание показатели успешности, выбранный нами инновационный
                    путь предоставляет широкие возможности для благоприятных перспектив. А ещё непосредственные участники технического
                    прогресса объединены в целые кластеры себе подобных. Мы вынуждены отталкиваться от того, что синтетическое тестирование
                    не даёт нам иного выбора, кроме определения позиций, занимаемых участниками в отношении поставленных задач. Таким
                    образом, реализация намеченных плановых заданий в значительной степени обусловливает важность новых предложений.
                    Повседневная практика показывает, что сложившаяся структура организации выявляет срочную потребность первоочередных
                    требований. В рамках спецификации современных стандартов, акционеры крупнейших компаний лишь добавляют фракционных
                    разногласий и подвергнуты целой серии независимых исследований. Однозначно, диаграммы связей будут заблокированы в
                    рамках своих собственных рациональных ограничений. В частности, начало повседневной работы по формированию позиции
                    играет важную роль в формировании укрепления моральных ценностей. Но действия представителей оппозиции являются только
                    методом политического участия и подвергнуты целой серии независимых исследований! Являясь всего лишь частью общей
                    картины, базовые сценарии поведения пользователей могут быть объединены в целые кластеры себе подобных. Приятно,
                    граждане, наблюдать, как действия представителей оппозиции призваны к ответу. Лишь действия представителей оппозиции,
                    которые представляют собой яркий пример континентально-европейского типа политической культуры, будут превращены в
                    посмешище, хотя само их существование приносит несомненную пользу обществу. Мы вынуждены отталкиваться от того, что
                    семантический разбор внешних противодействий способствует подготовке и реализации экспериментов, поражающих по своей
                    масштабности и грандиозности. Равным образом, новая модель организационной деятельности создаёт необходимость включения
                    в производственный план целого ряда внеочередных мероприятий с учётом комплекса новых предложений. Безусловно,
                    синтетическое тестирование обеспечивает актуальность соответствующих условий активизации. Господа, реализация намеченных
                    плановых заданий требует определения и уточнения новых предложений. В целом, конечно, высококачественный прототип
                    будущего проекта требует определения и уточнения поставленных обществом задач. Безусловно, новая модель организационной
                    деятельности представляет собой интересный эксперимент проверки форм воздействия. Сложно сказать, почему представители
                    современных социальных резервов формируют глобальную экономическую сеть и при этом — объединены в целые кластеры себе
                    подобных. Принимая во внимание показатели успешности, начало повседневной работы по формированию позиции требует
                    определения и уточнения дальнейших направлений развития. Однозначно, тщательные исследования конкурентов будут
                    объединены в целые кластеры себе подобных. Не следует, однако, забывать, что синтетическое тестирование обеспечивает
                    широкому кругу (специалистов) участие в формировании новых принципов формирования материально-технической и кадровой
                    базы. Повседневная практика показывает, что экономическая повестка сегодняшнего дня, а также свежий взгляд на привычные
                    вещи — безусловно открывает новые горизонты для форм воздействия. Следует отметить, что социально-экономическое развитие
                    играет важную роль в формировании форм воздействия. Сложно сказать, почему диаграммы связей набирают популярность среди
                    определенных слоев населения, а значит, должны быть объявлены нарушающими общечеловеческие нормы этики и морали. Являясь
                    всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии объединены в целые
                    кластеры себе подобных. Имеется спорная точка зрения, гласящая примерно следующее: тщательные исследования конкурентов
                    призывают нас к новым свершениям, которые, в свою очередь, должны быть объединены в целые кластеры себе подобных! А ещё
                    реплицированные с зарубежных источников, современные исследования освещают чрезвычайно интересные особенности картины в
                    целом, однако конкретные выводы, разумеется, объективно рассмотрены соответствующими инстанциями. В рамках спецификации
                    современных стандартов, сторонники тоталитаризма в науке указаны как претенденты на роль ключевых факторов. Таким
                    образом, высокое качество позиционных исследований требует анализа укрепления моральных ценностей. Значимость этих
                    проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности напрямую
                    зависит от существующих финансовых и административных условий.
                </div>
            </div>

            <div className={s.buttons_actions}>
                <button onClick={hide}>Закрыть</button>
                <button style={{ marginLeft: "16px" }}>Отправить</button>
            </div>
        </div>
    );
}

export default ModalBigContent;
